Repository: homov/EC-Alarm
Catalog: EasyCaster.Alarm/Properties/Resources.*.resx
Languages: uk

source: CANCEL
uk: СКАСУВАТИ

source: ADD
uk: ДОДАТИ

source: DELETE
uk: ВИЛУЧИТИ

source: START
uk: СТАРТ

source: STOP
uk: СТОП

source: TEST
uk: ТЕСТ

source: Task
uk: Завдання

# StartMessage
source: Start
uk: Почати

# StopMessage
source: Stop
uk: Зупинити

# ExecuteEvery
source: Repeea (s)
uk: Повторювати (c)

source: Activate
uk: Активувати

source: Press key
uk: Натиснути клавішу

source: Execute
uk: Виконати

# MessageNumber
source: Message #
uk: Повідомлення №

source: Find text
uk: Знайти текст

source: EDIT
uk: РЕДАГУВАТИ

source: SAVE
uk: ЗБЕРЕГТИ

source: Exclude messages
uk: Виключити повідомлення, що містять

source: Messages and Actions
uk: Пошук повідомлень

source: Schedule actions
uk: Розклад

source: Other settings
uk: Інші налаштування

# SaveMessagesTo
source: Save messages to (path)
uk: Зберегти повідомлення в (шлях)

# CallWebHook
source: Call web hook (url)
uk: Виконати запит (url)

# PrimaryСhannel
source: Primary channel
uk: Канал для пошуку

source: Test channel
uk: Канал для тестів

source: Telegram channels
uk: Канали Telegram

# AutomaticConnect
source: Automatic connect to the Telegram
uk: Автоматичне підключення до Telegram

source: Application settings
uk: Налаштування програми

# StartApplication
source: Start application when Windows starts
uk: Запуск програми під час запуску Windows

source: Password
uk: Пароль

source: Phone number
uk: Телефонний номер

# TelegramAccount
source: Telegram account settings
uk: Налаштування облікового запису Telegram

# PleaseEnterPhone
source: Please enter a phone number
uk: Будь ласка, введіть номер телефону

# WarningsFound
source: The following warnings were found:
uk: Було знайдено такі попередження:

# NoTelegramChannels
source: - no telegram channels specified
uk: - телеграм канали не вказані

# NoPrimaryTelegramChannel
source: - the primary telegram channel is not specified
uk: - не вказано основний телеграм-канал

# NoNessagesToProcess
source: - there are no messages to process
uk: - немає повідомлень для обробки

# ScheduleWillNotWork
source: - since the messages are not specified, the schedule will not work
uk: - так як повідомлення не вказані, розклад працювати не буде

# SaveConfiguration
source: Save this configuration?
uk: Зберегти цю конфігурацію?

source: Warning
uk: Застереження

source: Error
uk: Помилка

# PressSAVEorCANCEL
source: Press SAVE or CANCEL to end editing
uk: Натисніть ЗБЕРЕГТИ або СКАСУВАТИ, щоб завершити редагування

# PressEDIT
source: Press EDIT to change configuration
uk: Натисніть РЕДАГУВАТИ, щоб змінити конфігурацію

# SelectFolder
source: Please select a folder
uk: Виберіть папку

source: Select executable file
uk: Виберіть файл

# Files
source: Executable files (*.exe;*.cmd;*.bat;*.com)|*.exe;*.cmd;*.bat;*.com"
uk: Файли (*.exe;*.cmd;*.bat;*.com)|*.exe;*.cmd;*.bat;*.com"

# TestError
source: Error executing
uk: Помилка виконання

# SavingConfigurationError
source: Saving configuration error ({0})
uk: Помилка збереження конфігурації ({0})

source: Settings
uk: Налаштування

source: Message History
uk: Історія повідомлень

source: Application Log
uk: Журнал роботи

source: CLEAR
uk: ОЧИСТИТИ

source: Log level:
uk: Рівень журналу:

source: Information
uk: Інформація

source: Debug
uk: Відлагоджування

# Trace
source: Verbose
uk: Детально

source: Process list:
uk: Список процесів:

source: Select Process
uk: Виберіть застосунок

source: Enter email verification code:
uk: Введіть код підтвердження електронної пошти:

source: Enter phone number:
uk: Введіть номер телефону:

source: Enter password:
uk: Введіть пароль:

source: Enter verification code:
uk: Введіть код підтвердження:

source: Invalid value
uk: Недійсне значення

# EnterRequiredValue
source: Please enter the required value
uk: Введіть необхідне значення

source: Telegram Login
uk: Вхід в Telegram

source: Telegram connection state -
uk: Стан підключення до Telegram -

source: connected
uk: підключений

source: connecting...
uk: підключення...

source: disconnected
uk: відключений

source: Primary channel description
uk: Опис каналу для пошуку

source: Test channel description
uk: Опис каналу для тестів

source: Confirm
uk: Підтвердіть

# ConfirmDeleteMessage
source: Do you want to delete a message?
uk: Ви бажаєте видалити повідомлення?

# ConfirmDeleteTask
source: Do you want to delete the schedule?
uk: Ви бажаєте видалити розклад?

# ConfirmStopWork
source: Do you want to stop message processing?
uk: Ви бажаєте зупинити обробку повідомлень?

# ConfirmDeleteExclusion
source: Do you want to remove the exception?
uk: Ви бажаєте видалити виняток?

# ConfirmCloseApplication
source: Do you want to exit the application?
uk: Ви бажаєте завершити роботу з програмою?

# NewMessageWarning
source: Warning! New message!
uk: Увага! Нове повідомлення!

# PasswordIfExissts
source: Password (if required)
uk: Пароль (якщо потрібно)

source: Telegram account setup
uk: Налаштування облікового запису Telegram

# PHONE_NUMBER_FLOOD
source: Sorry, you have deleted and re-created your account too many times recently. Please wait for a few days before signing up again
uk: Вибачте, останнім часом ви забагато разів видаляли та заново створювали свій обліковий запис. Будь ласка, зачекайте кілька днів, перш ніж зареєструватися знову

# PHONE_NUMBER_INVALID
source: Invalid phone number. Please try again
uk: Невірний номер телефону. Будь ласка спробуйте ще раз

# PHONE_CODE_INVALID
source: You have entered an invalid code
uk: Ви ввели недійсний код

source: Phone number banned
uk: Номер телефону заборонено (banned)
